export const TITHI_SEQUENCE = [
  "कृष्ण प्रतिपदा",
  "कृष्ण द्वितीया",
  "कृष्ण तृतीया",
  "कृष्ण चतुर्थी",
  "कृष्ण पंचमी",
  "कृष्ण षष्ठी",
  "कृष्ण सप्तमी",
  "कृष्ण अष्टमी",
  "कृष्ण नवमी",
  "कृष्ण दशमी",
  "कृष्ण एकादशी",
  "कृष्ण द्वादशी",
  "कृष्ण त्रयोदशी",
  "कृष्ण चतुर्दशी",
  "अमावस्या",
  "शुक्ल प्रतिपदा",
  "शुक्ल द्वितीया",
  "शुक्ल तृतीया",
  "शुक्ल चतुर्थी",
  "शुक्ल पंचमी",
  "शुक्ल षष्ठी",
  "शुक्ल सप्तमी",
  "शुक्ल अष्टमी",
  "शुक्ल नवमी",
  "शुक्ल दशमी",
  "शुक्ल एकादशी",
  "शुक्ल द्वादशी",
  "शुक्ल त्रयोदशी",
  "शुक्ल चतुर्दशी",
  "पूर्णिमा"
]

export function getPaksha(tithi: string) {
  if (tithi.includes("कृष्ण") || tithi === "अमावस्या") return "कृष्ण"
  return "शुक्ल"
}